# EndHubId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalLink..::..EndHubId Property
AnalyticalLink Class See Also
---
Hub ID at end of AnalyticalLink.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId EndHubId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property EndHubId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ EndHubId {
	ElementId^ get ();
}
```

# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace